---
type: BRepBuilderGeometryId
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# BRepBuilderGeometryId

`Autodesk.Revit.DB.BRepBuilderGeometryId` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | BRepBuilderGeometryId | 2016 | `public BRepBuilderGeometryId ( BRepBuilderGeometryId other )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | InvalidGeometryId | 2016 | `public static BRepBuilderGeometryId InvalidGeometryId ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |